{"text":"\nChina Deserves Donald Trump - rm2889\nhttps:\/\/www.nytimes.com\/2019\/05\/21\/opinion\/china-trump-trade.html\n======\nNotPaidToPost\n> so he’d be wise to curb his nationalistic “no-one-tells-China-what-to-do”\n> bluster\n\nThis comment highlights both ignorance of Chinese history and continuing\nAmerican arrogance.\n\nChina has been painfully dictated what to do during the last 200 years. This\nhas had a profound effect on the country and has led to the collapse of\nimperial rule and the drive to 'rejuvenate' the country (to use the official\nterm in China).\n\nThis is also arrogant because it suggests that China should be told what to do\ncoming from THE country (the USA) that really is the archetype of \"no-one\ntells us what to do\".\n\nI would quip that one of the US's issues with China is that China is not told\nwhat to do and is too big to be easily coerced. A bit of a rude awakening for\nthe US...\n\n> Huawei then uses ... its rising global market dominance to set the next\n> generation of global 5G telecom standards around its own technologies, not\n> those of Qualcomm or Sweden’s Ericsson.\n\nWhich is exactly what Qualcomm did for 3G. Don't hate the player, hate the\ngame.\n\n~~~\nFjolsvith\n>> so he’d be wise to curb his nationalistic “no-one-tells-China-what-to-do”\nbluster >This comment highlights both ignorance of Chinese history and\ncontinuing American arrogance.\n\n>China has been painfully dictated what to do during the last 200 years. This\nhas had a profound effect on the country and has led to the collapse of\nimperial rule and the drive to 'rejuvenate' the country (to use the official\nterm in China).\n\nI disagree. China has been given some unfair advantages in order to help it\nbuild its economy over the last 40 years. Instead of growing up and becoming\nan adult, they've become the playground bully with their IP theft and closed\nmarket.\n\n>This is also arrogant because it suggests that China should be told what to\ndo coming from THE country (the USA) that really is the archetype of \"no-one\ntells us what to do\".\n\nIf China doesn't figure out the game real fast, they're going to lose it. And\nto do that, they really need to do what people are telling them they should\ndo.\n\n~~~\nNotPaidToPost\n> I disagree\n\nI should point that the part of my comment you quoted expressed the historical\nreality, not an opinion.\n\n~~~\nFjolsvith\nI still disagree.\n\n~~~\nNotPaidToPost\nThe good thing with disagreeing with reality is that reality does not care.\n\n------\ncfarm\nThis article makes a good point about \"cheating\". I personally don't like that\nword here, but by blocking other companies like Amazon, Google, FB, etc from\nentering in China, then copying those companies and selling the products to\nthe rest of the world, this presents a problem for trade fairness.\n\n","meta":"{'id': '19979654'}"}
{"text":"\nHow to Be an Effective CEO - terpua\nhttp:\/\/www.readwriteweb.com\/readwritestart\/2009\/07\/how-to-be-an-effective-ceo.php\n======\npclark\nloved this line: \"Core is what you have to do really well and do in-house.\nEverything else you can and should outsource\"\n\n","meta":"{'id': '685596'}"}
{"text":"\nA Survey of Deep Learning for Scientific Discovery - alokrai\nhttps:\/\/arxiv.org\/abs\/2003.11755\n======\nantipaul\nIn a survey on \"scientific discovery\", I would have expected more examples\nthan face and image recognition and natural language processing, which are so\nstale at this point.\n\nHealthcare? Physics? Chemistry? Biology? Sociology?\n\n~~~\nanthony_doan\nThe rest you listed require inference and causality.\n\nDeep learning does not do this.\n\nData with less noises are what most deep learning and non statistical models\ndoes well. Meaning that image, nlp, etc.. deep learning does well. But data\nwith lots noises\/uncertainty\/variance or even data that isn't large enough,\nsuch as time series, currently statistical models are still king\n([https:\/\/en.wikipedia.org\/wiki\/Makridakis_Competitions](https:\/\/en.wikipedia.org\/wiki\/Makridakis_Competitions)).\n\nEven with healthcare you're answering a question\/ hypothesis. This is where\nstatistical models strength lies because all statistical models are hypothesis\ntests and vice versa. There are very little opportunity in healthcare where\nyou would use deep learning compare to statistic. I've seen NLP can be of use\nbut the majority of work in healthcare are inference\/casuality base (this is\nwhy they use propensity model so much). I'm in this space public healthcare.\n\n~~~\np1esk\nInteresting you mentioned Makridakis competitions. There's one going on right\nnow on Kaggle, and the current leader believes a NN will be the winning model:\n[https:\/\/www.kaggle.com\/c\/m5-forecasting-\naccuracy\/discussion\/...](https:\/\/www.kaggle.com\/c\/m5-forecasting-\naccuracy\/discussion\/138881)\n\nMore generally, it seems that time series forecasting so far has mostly\nattracted statisticians with little DL experience [1]. Now that there is $50k\nprize, this will be a good test of whether statistical methods are \"still\nking\". If I were to enter this field, I'd probably look into latest\ntransformer based models, especially the ones used to model raw audio data,\ne.g. [2].\n\nThere's also a real possibility that whenever any strong forecasting method is\ndeveloped (DL based or otherwise) it's not published as the developers simply\nuse it to make money (betting, stock market, etc).\n\n[1]\n[https:\/\/journals.plos.org\/plosone\/article?id=10.1371\/journal...](https:\/\/journals.plos.org\/plosone\/article?id=10.1371\/journal.pone.0194889)\n\n[2] [https:\/\/arxiv.org\/abs\/1904.10509](https:\/\/arxiv.org\/abs\/1904.10509)\n\n~~~\nanthony_doan\nI'll wait to see the result at the end of the competition.\n\nThis is just one of the two competitions for m5. The other one is uncertainty.\n\n------\njefft255\nEric Schmidt, as in Google's ex-CEO, is the second author of this paper! I\ndidn't know he did any scientific research.\n\n~~~\nhervature\nHe has a PhD, unlike Brin and Page.\n\n~~~\njefft255\nRight, but they both were Ph.D. students and Brin I think published quite a\nbit of scientific papers before dropping out.\n\n------\nwswin\nfor the moment I thought it was from 2003\n\n------\nthrowqwerty\nLooks like a good summary. Will read. But at the rate the discipline moves I\nfeel like we need one of these every couple of months for everyone (not just\n\"lay\" scientists). Anyone know a good journal or something that produces a\nsimilar sort of survey frequently? Like once a quarter?\n\n~~~\nssivark\n“Rate at which the discipline moves” is mostly churn, not progress. Important\ninsights come at a slower rate — at the speed of human understanding, not at\nthe speed of conference papers. Good papers from even decades ago are likely\nto still be useful — in fact, they will have the key ideas presented simply\nand clearly, without much jargon or hype. Yes, deep learning practice moves\nquite fast these days, but that’s just the veneer on top of those deeper\nideas, trying out tweaks and variations. That’s not completely an indictment\nof deep learning, rather, any nascent field has a lot of confusing bustle.\n\n------\nbiomodel\nAlways wonder who these kinds of reviews \/ surveys are for? Nobody is going to\nlearn machine learning by reading a 50 page pdf. Meanwhile, people that have\nexperience will have a hard time finding the info they don't already know.\n\nOpinionated & narrow >> Shallow & comprehensive\n\n~~~\nmistrial9\nI will read it, to defend my non-DeepLearning choices for supervised ML .. so\nmany on the bandwagon for unsupervised CNN with their GPUs\n\n~~~\nmistrial9\nI am misunderstood here.. it means, for the purposes that are appropriate, use\na disciplined, supervised model.. and know the strengths and weakness' of the\nCNN models.. yes, some reaction to the hype of CNN..\n\n","meta":"{'id': '22705028'}"}
{"text":"\n\nSimple distributed computation with Clojure and nREPL  - dj-wonk\nhttps:\/\/github.com\/bluemont\/kuzu\n\n======\ndj-wonk\nSome comments, which may be obvious:\n\n* I have not tested Kuzu in production yet.\n\n* It has a tiny fraction of the power of real projects like Hadoop, Storm, Spark, and so on.\n\n* I created it because I wanted a simple way to run maps, reduces, and filters over many machines without making big changes to my original Clojure code. For this simple use case, many distributed computation systems seem quite complicated, so I thought it would be fun to write something extremely simple.\n\n* I was inspired by how PigPen [https:\/\/github.com\/Netflix\/PigPen](https:\/\/github.com\/Netflix\/PigPen) offers a very natural interface to Clojure. I wondered if that could work on top of something simpler than Hadoop + Pig.\n\n* This isn't the first time something like this has been done. See net-eval for example [http:\/\/nakkaya.com\/2010\/02\/16\/net-eval-dead-simple-distribut...](http:\/\/nakkaya.com\/2010\/02\/16\/net-eval-dead-simple-distributed-computing-for-clojure\/).\n\n* Kuzu may or may not be useful to you, but I'd be interested in any and all commentary.\n\n","meta":"{'id': '7829473'}"}
{"text":"\n\nColor CEO explains how\/why they raised $41M  - jasonmcalacanis\nhttp:\/\/www.youtube.com\/watch?v=_WGdwY6h5JI&list=SL#\n\n======\narepb\nAfter being prepared to hate this company, it's actually hard not to love this\nguy. The idea is really interesting, too. \"The implied social network will\nlead to better behavior\" -- interesting thought.\n\n","meta":"{'id': '2384827'}"}
{"text":"\n\nAnyone know of a site where the crowd votes to make someone famous every day? - amichail\n\nOr some variation on that theme?\n======\nanamax\n\"Make someone famous\" is more than \"a person becomes known by lots of other\npeople\". There's also some persistence.\n\nYes, a site that has lots of visitors can make them aware of a given person,\nperhaps even once a day, but what do said visitors get out of it and why will\nthey remember last week's \"new star\"? Note that \"make aware\" happens before\nmass voting. Mass voting can only choose between exposed folks.\n\nA small group can vote to expose someone to a larger group, but that assumes a\nsolution to a fairly hard problem - why does the larger group delegate their\nattention selection to said small group?\n\n------\nkqr2\nWould it work like a lottery?\n\n","meta":"{'id': '453484'}"}
{"text":"\nAsk HN: What would work well in a country built on the Unix Philosophy? - Numberwang\nIt seems to me counties end up with rules and institutions with increasingly less chance of improvement yet a accumulated complexity.<p>Would the Unix Philosophy when applied to country building help with this problem?\n======\nsova\nIf all legislation followed the model presented by git (versioning,\nincrements, branches, merges, and total transparency) I think that it would\nreflect positively on a true democracy.\n\nThe next step, however, would be to educate the populous so that all voters\nwere informed, and that voters would be presented (in an elegant fashion) with\nwhat is relevant to their districts on the three tiers of national, state, and\nlocal policy. I don't know if Unix has a good metaphor or reflection of this,\nbut unix is meant to be a) modular and b) minimalist, so if we can sponsor the\nidea of true modularity in voting, I think we could see some full-\nparticipation schemes that are not overwhelming. I don't have to vote on every\nissue, but could vote on collections of issues that reflect my general\nideology or current understanding of what best suits the republic.\n\nAnother issue though, is ownership. In the Feudalistic Republic of the United\nStates (as of 2016) it's hard to describe a system that could be adopted\nreasonably that promotes the idea that all the nation belongs to everyone in\nit. We have some things like \"the right to life, liberty, and property [often\nmisquoted as 'happiness' at the end here]\" and how does one reconcile this\nidea of property with a truly harmonious community? Good question.\n\nSo in short, the basis of the Unix philosophy would help (especially with law\nversioning, that is just what needs to happen and is so brilliant and clear I\nam surprised there is not greater traction for it). All Laws need time limits\n(and easy renew options if they are good)... And the entire populous needs\nhigher quality information that [forces?] causes people to consider the\ncommunity at large.\n\n\/rattle like a snake\n\n~~~\noftenwrong\nI have been quietly advocating for version controlled legislation for a long\ntime. Here in Massachusetts, bills describe what they would change in the text\nof a statute directly - a bit like an ed script. Here's an actual example:\n\n>SECTION 2. Said section 35 of said chapter 123, as so appearing, is hereby\nfurther amended by striking out the words “is an alcoholic or substance\nabuser”, in lines 17 and 18, and inserting in place thereof the following\nwords:- has an alcohol or substance use disorder.\n\n>SECTION 3. Said section 35 of said chapter 123, as so appearing, is hereby\nfurther amended by inserting after the word “a”, in line 36, the third time it\nappears, the following word:- qualified.\n\n>SECTION 4. Said section 35 of said chapter 123, as so appearing, is hereby\nfurther amended by striking out the fourth and fifth paragraphs and inserting\nin place thereof the following 3 paragraphs:-\n\nAs someone who attempts to keep informed about changes to the law, this style\nis a huge obstacle. It often necessitates a lot of manual piecing-together in\norder to form a complete view of the final change. A simple diff view would\nmake it much easier to understand.\n\nI have considered tracking changes to the law in git, including representing\nbills as branches, as a side project idea, but I determined it would require\nfar more effort than I am willing to put in.\n\n~~~\nsova\nWow sir. That is really a great list of examples! It actually seems [very\nvery] feasible to make a simple system that could automate this based on the\nlanguage used. It would be a worthwhile endeavor, but like you say, would take\na lot of time\/effort investment.\n\nPerhaps an open-source effort that does this (tracks and updates current laws\nand shows diffs) could be a worthwhile beginning?\n\nI think every senator and representative that has ever had to amend\nlegislation would delight at the thought.\n\n~~~\noftenwrong\nI was only considering doing it manually. I don't know how feasible it would\nbe to automate the conversion process. The formatting and language used in\nthese \"edit script\"-style bills varies considerably, as they are written for\nhumans by humans with no standardisation.\n\n~~~\nsova\nHonestly, this seems like one of the more realistic problems NLP could\nactually solve. Yes there may be many variants, say 100 or even 1000 different\nstructures and vocabularies for updating versions, but a differential neural\nnetwork where you have inputs (like the pre-amended law) and outputs (like the\nlaws after the \"amendments\" or version bumps) would actually be perfect for\nlearning what means what and when to do it.\n\nIt would be the perfect grad project for someone interesting in bridging the\ngap between computation\/machine learning and legislation.\n\nOf course, it would be a little tedious setting up the learning (thousands of\nsets of input cases and output cases) but in the end the findings could be\nused across the board.\n\n------\narkitaip\nHow do you define The Unix Philosophy as applied to a country? Software\ndoesn't come close to the complexity of an entire country so your analogy\ncould possibly be fundamentally mismatched...\n\n~~~\nNumberwang\nWell I believe that fundamentally the complexity of a country is to a large\nextent historical artifacts.\n\nHow do you think the relations between institutions would be different, how do\nyou think they would perform their functions differently? What would their\nstructures be?\n\nOr focus on some specific example -How would voting be different? -How would\nregistering for a licence be different? -How would taxation be different?\n\n~~~\nsova\nI think with taxation we could also do very cool things: Say your nation taxes\nat 30%, what if every voter had a subset of that value (say, 12.2%) that they\ncould choose which district or set-of-needs to fund?\n\nLike maybe I want my 12.2 to go to education for kids 6mnths-12years, or maybe\nI want to fund state medicines, and my neighbor and I both pay the base rate\nthat covers necessities like roads and stuff, but he may fund shelters instead\nof medicine specifically with his 12point2. It could be really wonderful.\n\nIn effect, people may become more participatory in their own governing\nsystems, and could actually direct funds instead of relying on bill-makers to\nfigure out where to spend monies\/resources.\n\n------\nangersock\nThe plumbing, presumably.\n\n~~~\nbbcbasic\nThe sewerage and garbage can be piped into \/dev\/null\n\n------\noftenwrong\nNational PKI. Every citizen would have a key pair. I believe I have read that\nEstonia has implemented this.\n\n~~~\nNumberwang\nWhat could it be used for?\n\n~~~\nsova\nVoting! And easily verifying a) your vote was\/is counted and b) is accurate\nfor what issues\/candidates you voted for. In fact, we could eliminate most\ncandidates because they are only there to \"represent\" the wills\/intentions of\ntheir constituents. Gloabl PKI pairings for voting would eliminate the need\nfor a lot of \"representatives\" and we could do more direct forms of democracy\ninstead!\n\n","meta":"{'id': '12585834'}"}
{"text":"\nNumber of Users on Each Plan - danw\nhttp:\/\/www.barenakedapp.com\/dropsend\/number-of-users-on-each-plan\n======\njwecker\nnice post. In my experience also the lowest paying accounts are the most\ndifficult to maintain- out of proportion certainly to the revenue they bring\nin. However, one thing it didn't mention here is to remember not to discount\nmarket share. In lots of apps the higher subscription plans will only be\nupsales- no one will jump straight into the business account, for example. And\nin some cases your low paying accounts are doing a lot of evangelizing for\nyour product, or not using a competitors product, etc. Keep it balanced, for\nsure, but get lots of users.\n\n","meta":"{'id': '3714'}"}
{"text":"Ask HN: What are well designed SaaS websites? - piu\n======\nksec\nStripe.com\n\nSimple, Consistent, fast , effective.\n\nThere are many other listed here as well. They mostly follows the same layout\nand pattern. What separate them are wording and graphics. Using simple words,\nand shortest sentence possible to describe your SaaS, and choice of graphics,\nwhich really is a matter of personal taste.\n\nI think Stripe manage to do this very well.\n\nOff Topic: Did Stripe ever talk about their Ruby Stack?\n\n~~~\nsimlevesque\nOn Stripe I really like that you can see the logs of every API call you've\never made with the request headers and body and response body... It makes\nworking with it much easier than Braintree.\n\n~~~\nMandatum\nDoes Stripe write about how they handle storing those requests\/responses?\nSeems like this could get very expensive, very quickly.\n\n------\nkenning\nI think turbotax has a pretty phenomenal interface if you're in the bracket of\npeople with really simple taxes. Two and three years ago, my taxes took me\nabout an hour.\n\nDepending on what you're looking for, you may also be interested in aping\ntheir freemium model, where the first time you use the service is free and\nsets you up quite well to reuse the service next year and pay $40 for one of\ntheir obnoxious services. As a customer it was quite frustrating but it\nsucceeded in getting me to pay $40 the second year, and had I not gone far out\nof my way to remove the \"plus\" and \"premium\" features I would have ended up\npaying ~$100 the first year and $140 total the second.\n\nThe third year I switched to a competitor and got to use their service for\nfree. In a way, using turbotax felt like a great UX mixed with a battle to\nread everything extremely carefully and retread my steps to avoid paying\nanything; to me, this is not all that morally reprehensible because it\nadversely affects people who don't value their money as much as their time.\nHowever it also seemed predatory in that a non-tech-savvy user such as my\nparents would likely be tricked into paying higher costs for essentially no\nadded value.\n\n~~~\ntootie\nThey have a really solid approach and keeping each step really straightforward\nand discrete to avoid overwhelming you with too much to think about at once.\nIt still fails really hard when you get to anything outside their flow. I had\nto spend time googling the awkward set of steps needed to deduct mortgage\ninterest. Ultimately, it wasn't hard, but it wasn't at all obvious how to do\nit.\n\n~~~\nbeamatronic\nUm... maybe you had a strange situation but usually for mortgage interest on\nyour home , your lender sends you a form with essentially 1 number on it and\nyou just enter this form into TurboTax when it asks you.\n\n------\nbjterry\nIt seems the question is ambiguous. Everyone is responding with the marketing\nwebsites of SaaS compnaies, but I interpreted it as asking for well-designed\ninternal interfaces of SaaS websites. Would love to see examples of that which\npeople think are particularly great. Personally I've always found Gusto and\nBasecamp to have very good interfaces. Stripe's internal interface (which\nothers have mentioned for their public site) gets the job done but I would\nhardly call it great.\n\n------\nphilip1209\nSome of my favorites:\n\n[https:\/\/mailchimp.com](https:\/\/mailchimp.com)\n\n[https:\/\/transitapp.com\/](https:\/\/transitapp.com\/)\n\n[https:\/\/www.intercom.com\/](https:\/\/www.intercom.com\/)\n\n[https:\/\/lattice.com\/](https:\/\/lattice.com\/)\n\nI'm fond of what we have built:\n[https:\/\/www.moonlightwork.com](https:\/\/www.moonlightwork.com)\n\n~~~\nwhitepoplar\nHey, curious about your experience with Mailchimp. I've noticed that people\nseem to either love it or hate it. What do you think they do well? Where do\nthey fall short? (if at all)\n\n~~~\njonathan-kosgei\nI hate mailchimp and prefer to use tinyletter.com. I can't talk enough about\nhow much I love tinyletter!\n\n~~~\nflaviocopes\nTinyLetter is amazing. Simple, easy to use, just does what you need without\ntemplates, campaigns and other stuff that gets in the way between you and\nsubscribers receiving an update from you.\n\n------\nanacleto\nNeedless to say Stripe.com \\-\n[https:\/\/www.plainflow.com\/](https:\/\/www.plainflow.com\/) \\-\n[https:\/\/sentry.io](https:\/\/sentry.io) \\-\n[https:\/\/slack.com](https:\/\/slack.com) \\-\n[https:\/\/figma.com](https:\/\/figma.com) \\-\n[https:\/\/basecamp.com](https:\/\/basecamp.com)\n\n~~~\nphilfrasty\nI found Slack rather poor in explaining what they are doing. This text is\nbasically their entire landing page.\n\n\"When your team needs to kick off a project, hire a new employee, deploy some\ncode, review a sales contract, finalize next year's budget, measure an A\/B\ntest, plan your next office opening, and more, Slack has you covered.\"\n\nDo they offer A\/B testing? HR tools? Code deployment? Who would have guessed\nit is chat.\n\nTheir \/features page does a better job: \"It simplifies communication. Slack\nbrings all your team's communication together, giving everyone a shared\nworkspace where conversations are organized and accessible.\"\n\n~~~\nanacleto\nTrue.\n\nBut that's actually a common trend. When the company's brand gets bigger and\nstronger in people's mind, company position slowly switches from\n\n1 Product attributes\n\n2\\. Product benefits\n\n3\\. Emotional benefits\n\n4\\. Something bigger\n\nThis applies well to every type of product. SaaS included.\n\nThis is a great essay on the topic:\n[https:\/\/medium.com\/speroventures\/branding-for-\nbuilders-19e10...](https:\/\/medium.com\/speroventures\/branding-for-\nbuilders-19e103ef3f1d)\n\n------\nlwansbrough\nI was wondering the same thing the other day: looking for inspiration but also\nexperienced recommendations and UI patterns. Found this with a quick Google (I\nhave no affiliation): [https:\/\/blog.chartmogul.com\/saas-landing-\npages](https:\/\/blog.chartmogul.com\/saas-landing-pages)\n\nAlso I found Pinterest to be a good resource for finding designs (more so than\nDribbble, Behance, etc. surprisingly.)\n\n------\nspking\n[https:\/\/baremetrics.com](https:\/\/baremetrics.com)\n\n[https:\/\/sendgrid.com](https:\/\/sendgrid.com)\n\n[https:\/\/www.drift.com](https:\/\/www.drift.com)\n\n[https:\/\/lookback.io](https:\/\/lookback.io)\n\n[https:\/\/reply.io](https:\/\/reply.io)\n\n~~~\nbriandear\nBaremetrics for sure. Really effective — the dashboard gives you all the\nimportant data quickly and then you can easily drill down. I use their product\nseveral times a day and it’s the best interface of all of the many services I\nuse.\n\n------\njonathanbull\n[https:\/\/lookatthatsaas.com](https:\/\/lookatthatsaas.com) is a good resource\nfor inspiration.\n\n------\nqstearns\n[https:\/\/segment.com\/](https:\/\/segment.com\/) seems to take design really\nseriously. They also have a pretty nice React toolkit here:\n[https:\/\/segmentio.github.io\/evergreen\/?selectedKind=alert&se...](https:\/\/segmentio.github.io\/evergreen\/?selectedKind=alert&selectedStory=Alert&full=0&down=0&left=1&panelRight=0&downPanel=storybook%2Factions%2Factions-\npanel)\n\n------\ntschellenbach\nI frequently compare [https:\/\/getstream.io\/](https:\/\/getstream.io\/) with\n[http:\/\/stripe.com\/](http:\/\/stripe.com\/),\n[https:\/\/www.mapbox.com\/](https:\/\/www.mapbox.com\/), sendbird.com, algolia.com,\npusher.com and [https:\/\/layer.com\/](https:\/\/layer.com\/)\n\n------\nruairidhwm\n[https:\/\/stripe.com](https:\/\/stripe.com) \\- It's beautiful but conveys all the\ninformation that you need quickly. It also has excellent copy.\n\n[https:\/\/canny.io](https:\/\/canny.io) \\- Very crisp design and it conveys the\nuse case really well.\n\n[https:\/\/baremetrics.com](https:\/\/baremetrics.com) \\- This has come such a\nlong way and has stunning design.\n\n------\nigorv\nNot really a SaaS website, but I really dig this\n[https:\/\/district0x.io\/](https:\/\/district0x.io\/)\n\n~~~\n2bitencryption\nI'm not too fond of that \"stay up to date\" modal, which tries to mimic system\nnative UI.\n\n------\nwhitepoplar\n[https:\/\/dnsimple.com](https:\/\/dnsimple.com)\n\n[https:\/\/basecamp.com](https:\/\/basecamp.com)\n\n[https:\/\/sentry.io](https:\/\/sentry.io)\n\n[https:\/\/semaphoreci.com](https:\/\/semaphoreci.com)\n\n[https:\/\/instapaper.com](https:\/\/instapaper.com)\n\nOld Heroku :-(\n\n~~~\njohnhenry\nWhat's changed about Heroku that's made you unhappy? (Not an employee, just\ncurious).\n\n~~~\nwhitepoplar\nTake this copywriting, for example:\n\n2011: \"Forget Servers - Get up and running in minutes, and deploy instantly\nwith git. Focus 100% on your code, and never think about servers, instances,\nor VMs again.\"\n\n2018: \"Deploy and run apps on today's most innovative Platform as a Service -\nHeroku is a cloud platform based on a managed container system, with\nintegrated data services and a powerful ecosystem, for deploying and running\nmodern apps. The Heroku developer experience is an app-centric approach for\nsoftware delivery, integrated with today’s most popular developer tools and\nworkflows.\"\n\nWhich is better?\n\n~~~\nHeyLaughingBoy\n2018: it describes what they do in a much clearer way.\n\n------\nsimantel\nFor lots of examples, check out\n[https:\/\/www.pages.xyz\/](https:\/\/www.pages.xyz\/)\n\n------\nCommanderData\nI recently came across toggl for time tracking and reporting.\n\nToggl - Time tracking -\n[https:\/\/toggl.com\/pricing\/](https:\/\/toggl.com\/pricing\/)\n\nTheir pricing page is one of a nicest I've seen, really easy to grasp but also\nfunctional eye candy.\n\nI even hoped it was a WP template so I could customize one myself.\n\n------\nleonroy\nClubhouse is an excellent example of site and web app and their approach and\nintegration with both has clearly had a LOT of thought put into it:\n[https:\/\/clubhouse.io](https:\/\/clubhouse.io)\n\nProbably use it more than any other SaaS and am glad it’s so good.\n\n------\ndeadcoder0904\nFind some great Inspiration at [https:\/\/hyperpixel.io](https:\/\/hyperpixel.io)\n\n------\noferzelig\n[https:\/\/omnystudio.com\/](https:\/\/omnystudio.com\/)\n\n------\ncyberferret\nCan I chime in here, not with a link to any specific site, but just as a call\nout to patterns that I am seeing recently.\n\nA lot of sites now have lists and content that updates automatically as things\nhappen on the back end. One good example is Intercom. I have their screen open\n24x7 on the first tab of my browser so I can monitor users on our site. I love\nhow it updates the 'time last seen' dynamically, and I usually have my\ncustomer list sorted by the 'time last seen' field.\n\nBut sometimes, while the content of the list fields are updated in real time,\nthe sorting of the list is not, and the list goes out of order (i.e. customers\nwho re-login recently are still shown lower down in the list that customers\nwho logged in an hour ago even though the 'last login time' is more recent.\n\nI wish there was a way in these instances to just refresh the list within the\npage, without doing an entire browser page refresh, which could take up to 10\nseconds in the old Intercom UX. Also, while talking about Intercom, jumping\nbetween the Customers page and the Conversations page could also take anything\nfrom 5 to 10 seconds on my browser, and there was NO indication that anything\nwas happening in the meantime, which increased confusion and frustration. I\nthink we need to bring back the hourglass or some other 'waiting' indicator\nfor transitions that take a while.\n\n(NB: The new Intercom UX has improved on the waiting delay significantly, but\nnot the sort ordering of the customer list).\n\nSomeone also mentioned the Stripe design (of their back end, not their\nmarketing site). I tend to like the new design of their admin panel, however\ntheir menu hierarchy was a little confusing, making it hard to find things a\nlot of the time. Also, the redesign tends to break the 'back button' behaviour\na lot. I tend to spend a lot of my time on the Stripe admin panel looking at\nwebhook logs etc., and every time I bring up the log listing, then drill down\nto an entry I can't seem to go 'back' to the list easily without the system\nrebuilding the entire list each time. Makes it frustratingly slow to try and\nfind the exact log entry I want when I have to spend so much time waiting for\npage refreshes.\n\nIn summary, I think we need to go back to these 'old fashioned' design\nconstructs which aren't considered \"trendy\" any more:\n\n* Give the user some sort of 'waiting' indicator if a page redraw is going to take time.\n\n* If a list on your page refreshes in the background, and your user can sort the list, make sure you update the sort order as well as the content\n\n* Don't break the back button behaviour if you can help it.\n\n------\njacobwg\n[https:\/\/webflow.com\/](https:\/\/webflow.com\/) \\- complex product, but the\nmarketing site makes it clear and understandable\n\n------\nhartator\nShameless plug, I kind of like the work we did on our own SaaS website:\n[https:\/\/serpapi.com](https:\/\/serpapi.com)\n\n------\nvelp\npitchbook.com\n\nInteresting mix of content and product information. I like how it's laid out\nas well\n\n------\nMojah\nMy favorites:\n\n\\- stripe.com\n\n\\- ohdearapp.com\n\nSimple, to the point & clean layouts.\n\n------\njohnhenry\nDid you mean that the services themselves are well designed or are you\nreferring to pages that describe them?\n\n------\njiveturkey\ndoes ecommerce count? mcmaster.com\n\n~~~\nmanuaero\nagreed ... mcmaster is one of the best designed sites.\n\n------\nfairpx\nChiming in after seeing us get mentioned here (context: lead designer @\n[http:\/\/Fairpixels.pro](http:\/\/Fairpixels.pro))\n\nWorking with engineers of b2b saas companies every day, for more than a year\nand having analysed all the best SaaS companies who have 10+ internal\ndesigners, I found a couple of principles that anyone can apply to make their\nwebsite look decent:\n\n* Consistency - One practical example: If you use a 4px border-radius, use a 4px radius everywhere. It may sound small, but having a consistent experience across your application makes the product feel so much more polished to your users. Don't use multiple fonts, different navigation menus etc. Keep it consistent.\n\n* Reduction - If anything, design isn't about adding more things to make it 'look nice'. Try to remove as many things as you can. If something doesn't serve a specific function, then remove it. Every pixel should make sense. The more you put in front of your users, the more brain power it'll require to process.\n\n* Divide - This is mostly UX, but one thing I see so many get wrong. A lot of SaaS apps overwhelm their users. They present them with all the features upfront. Whether it's a long onboarding form, or a dashboard with 50 actions one could take. By splitting up things in different ways, you can guide the user through the experience. Your signup process for example (that might be a big block in conversion) might be made so much better if you ask for certain types of information later on in the process.\n\n~~~\nvincentmarle\nI very much like your fixed fee \/ month business model. Exactly what I need, I\nwill likely become a customer soon.\n\nIs there a similar service out there that has fixed pricing for web\/app\ndevelopment?\n\n~~~\nredmaple\nsaw this few weeks ago:\n[https:\/\/greenpine.co\/#pricing](https:\/\/greenpine.co\/#pricing)\n\n------\niampaul\nMost SaaS businesses are run by engineers and unfortunately many of them\/us\nlack the eye for style. That said, here are two of my favorites:\n\n[http:\/\/fairpixels.pro](http:\/\/fairpixels.pro) \\- I found these guys here on\nHN and their work seems spot on.\n\n[https:\/\/www.spotify.com\/](https:\/\/www.spotify.com\/) \\- their simple design\nand IPO should be an example for fellow engineers who’re building saas.\n\n~~~\nrahimnathwani\nFairpixels doesn't appear to be a SaaS service, but a service company that\ndoes design (not only for SaaS).\n\nI'm curious:\n\n\\- is there a particular SaaS designed by fairpixels that you consider an\nexample of good SaaS design?\n\n\\- do you have any relationship with Fairpixels? Your HN account has posted 2\ncomments since being created, and both those comments recommend fairpixels.\n\n~~~\niampaul\nIve been following their progress for over a year and am a customer. They’ve\nstructured their website and business like a Saas. I don’t know about all of\ntheir customers but I love the work they did for Uphex.com for example.\n\n------\nsoulchild37\nWould recommend [https:\/\/stunning.co\/](https:\/\/stunning.co\/) , I like the\nfloating tube animation and the increasing recovered amount is really\nappealling.\n\n~~~\nRjevski\nMeh, I disagree, the design looks dated.\n\n~~~\nsamstave\nI agree - it feels poorly-designed-2012\n\nBut thats not a knock on their offering - if their customers are happy and\nthey are doing a good job, then more power to their servers.\n\n","meta":"{'id': '16837683'}"}
{"text":"\nYou think you know what teachers do. Right? Wrong. - mathattack\nhttp:\/\/www.washingtonpost.com\/blogs\/answer-sheet\/wp\/2014\/02\/22\/you-think-you-know-what-teachers-do-right-wrong\/\n======\nsramsay\nThis is true of being a professor as well (I certainly didn't understand what\nteaching really was about until I starting doing it).\n\nI've always thought that our graduate students should be made to take acting\nlessons, because there's an element of second-order persuasion you have to do\nin a classroom that's hard to learn and difficult to describe but that shares\nsome similarity to acting -- or maybe just rhetoric in the very ancient sense.\n\nYou can't just purvey information and mumble something about its importance.\nUltimately, you're modeling what it means to be an intellectual -- trying to\ngive your students certain habits of mind by showing them how those habits\nplay out in practice.\n\nWe also spend an enormous amount of time trying to devise strategies for\ndealing with students who just don't get it (and you quickly learn -- or\nbetter learn -- that this might be the most important part of the job).\n\nI could say more, of course. It's a very subtle set of skills -- more art than\nscience, as they say. It's hard to do it at the college level, and I think\nit's far, far harder to do it at the elementary level, where the stakes are\nmuch higher.\n\n~~~\nbarry-cotter\nWhat kind of third level institution do you work at? One is under the impress\nthat going from passable to outstanding in teaching has much, much less effect\non one's chances of getting tenure than going from mediocre to good in your\nresearch.\n\n~~~\numanwizard\nThey never said it was particularly important for career advancement. How did\nyou read that into their post?\n\nAlso, what's with the condescending sneery tone?\n\n~~~\nadestefan\nBecause every time a post on education comes on HN everyone thinks they know\nall the answers. The comments end up turning into a \"Well this is the real\nreason...\" or \"Everyone needs to be just like...\"\n\nThe discussions end up being so worthless that I now flag every education\nrelated post on HN because it's just not worth the time here.\n\n~~~\njedmeyers\nWhy do you think it's called master of Arts in teaching, and not master of\nScience?\n\n------\nSniperfish\nMy wife is a teacher. I am consistently shocked how much work she does in\nevenings, weekends. I earn more than twice as much as her and more than her\nmaximum salary cap (we are both early in our careers). She blows me away in\nher dedication and effort, it's a great inspiration for me to continually\nstudy and work harder.\n\nI mention it to people and always hear 'well maybe she is different but I've\nseen lots of teachers and they just do it for the holiday'. As if everyone is\nequally dedicated in any profession. As if the guy that sits at his computer\n'working' for hours a day is a more efficient or effective worker just because\nhe does more hours. As if outside observers of any industry can really spot\nwho is producing vs who is not.\n\n~~~\nmontecarl\nI can echo your story exactly. My wife teaches and is involved in an after\nschool program. It isn't football but has a similar time commitment. During\ncertain parts of the year she works 6 days a week often leaving the house at 8\nam and returning at 9 or 10 pm. It is insane. Two other teachers in her\ndepartment work similar hours. The pay per hour isn't very good once you\nfactor all of that in.\n\n~~~\nGotAnyMegadeth\nAt the other end of the spectrum, one of the teachers at my old school used to\nturn up at 8:30 and leave at 15:30. She used to put a video on, and then hand\nout worksheets to fill in whilst she marked the worksheets from the class\nbefore. Terrible teacher, luckily I only had her for a few weeks.\n\n~~~\nnumo16\nI have a few friends that are teachers and most of their schools wouldn't\nallow for this sort of thing to happen. Teachers aren't allowed to sit at\ntheir desk while a class is in session, they must be instructing or walking\naround (during a test, video, etc...). They get a planning period, where they\nmight have a chance to do some grading or lesson planning, if they don't need\nto meet with a parent or something. This means they need to either stick\naround school several hours after it lets out to grade work and do lesson\nplans, or bring it home and work on it that night.\n\n------\nsaosebastiao\n>The problem with teaching as a profession is that every single adult citizen\nof this country thinks that they know what teachers do. And they don't. So\nthey prescribe solutions, and they develop public policy, and they\neditorialize, and they politicize. And they don't listen to those who do know.\nThose who could teach. The teachers.\n\nSorry, I cant take this seriously. The teachers unions are one of the most\npolitically powerful entities in the US. They can make a candidate, and they\ncan break a candidate. They can pass and tank ballot measures...even ones\ncompletely unrelated to their jobs. They can protect drunkards and criminals\nfrom getting prosecuted, let alone fired. They are fine forcing their agenda\ndown our throats, but they cant take a little pushback?\n\n~~~\npbhjpbhj\n> _They are fine forcing their agenda down our throats_ \/\/\n\nThe agenda of ensuring children have access to life-enhancing educational\nopportunities?\n\n> _They can make a candidate, and they can break a candidate._ \/\/\n\nYou mean a political candidate? You really think that the combined voice of a\ngroup of teachers can do that against the weight of media conglomerates, other\nunions, rich lobbyists and other political groups? Any examples?\n\nPresumably under your assertion the education system in the USA is the one\nthat the teaching unions have won by political action and the politicos and\nbusiness people are looking on powerless to influence it?\n\n~~~\nPaulHoule\nWell, I can say that in two weeks of homeschooling I got my son to write more\nthan they did in five years.\n\nHe was having trouble with bullies and the school did nothing about it. They\npretty much gave up on teaching spelling completely. We found out that our\nschool is a \"magnet school\" for behaviorally disturbed \"special\" kids from\nother districts so kids in the rich school and kids in the poor school where\ncommunities complain a lot get to enjoy a safer environment because the rural\nschool gets all the psychotic kids.\n\nI gave up on them when the superintendent gave a \"town hall\" where he told the\nmother of a \"special\" kid that he was a partner in his education and he told\nme I should just butt out because he was the expert and there's a new paradigm\nand homework is obsolete and because I don't have a phone number to call to\nget Albany breathing down his neck.\n\nF the teacher's unions.\n\n~~~\nking_jester\nThe problems you experienced go beyond teachers unions. Dumping \"problem\" kids\ninto one school is a recipe for disaster and communities are not served by\nthat kind of thing at all (except those that dumped off students, although I\nwould argue those communities aren't fixing their underlying problems).\nAdministrator heavy, top down approaches that override community and teacher\nautonomy are a bad thing in general, and the obsession with testing over\nstandard lessons and homework is a huge problem with the way the public\neducation system is run.\n\nUltimately teachers as a professional class deserve a union. We see in other\nplaces and countries that the unions do not serve as an impediment to a\nquality public education, so we have to ask ourselves what is really going on\nwith current systems and unions that make the situation so shitty (esp. in New\nYork state).\n\n~~~\nPaulHoule\nI'm not saying that teachers shouldn't have a union, but from my perspective\nit is part of the problem rather than the solution more often than not.\n\nFor instance, they opened a charter school in our district which seems to be\nan honest effort to provide a safe (bullying free) environment for the high\nschool and there have been two people associated with the union who have just\nbeen consistently hateful trying to shut it down.\n\n~~~\nking_jester\nThe charter school movement is one of those things that draws strong opinions.\nInitiatives to provide safe school environments are good, but privatized\ncharter schools have a lot of downside in terms of how a community, parents,\nand teachers can retain control over how education happens. In New York state\nin particular, there has been a strong effort to close public schools and open\nprivate charters, which in my opinion is the wrong way to fix problems with\npublic education. The disagreement over charters isn't just a union thing,\nalthough public educators would be upset to see the system they work for\ndismantled instead of repaired.\n\n------\nShivetya\npuff piece, if not pure propaganda bordering on hyperbole.\n\nPeople and students respect teachers as a whole, what they do not respect and\nI bet many in the profession do as well is the inability to remove those who\nare not good teachers.\n\nIt is not a position one walks into without many upon many stories about what\nyour really getting into. My Aunt retired from the trade, her aggravations in\norder that I remember are, Administrative people(usually political\nappointees), other teachers, and parents. There were a few others but mostly\nthe tripe coming down from non teachers within the system seemed to be what we\nheard of.\n\nThat and the personal money she spent to have supplies because it was more\nimportant to blow money on marble floors than supplied, or having someone's\nwife\/kid\/friend in some advisement position that did nothing but occupy space.\n\nGuess what, I can say the same of some other service professions, having a\nneighbor who does night shifts as a nurse and hearing the horror stories of\nwhat she puts up with is enough to let me know some jobs come with extra\nmental if not physical stress.\n\nI think in the end we are all more than willing to heap accolades on good\nteachers. Its a system where the kids aren't first that irritates\n\n------\nsteveplace\nTeacher worship can only go so far.\n\nBecause this post makes the claim that _all_ teachers should be looked up to.\n\nMy entire family consists of teachers. They know who the bad teachers are.\nYou've got Paulina Pensioner who just shows old VHS tapes as a history\ncirriculum. Or Carl the Coach that knows, just _knows_ there's only one way to\nsolve this pre-algebra problem.\n\nAnd some teachers work hard. They bust their ass and bring grading home and\nlesson plan on the weekends.\n\nBut they aren't the problem. There's a bad system that keeps bad teachers in\nat the expense of the good.\n\nSo they design tests and standards as a way to \"firewall\" these bad teachers\nin, to turn their poor performance into mediocre performance. And there's a\ncost, because it removes the creativity and initiative from the good teachers.\n\nI understand that the goal of the author is to criticize common core, but\nwhile the conclusion is sound (Core is garbage) the reasoning is not.\n\nAnd the new standards being developed? One of the main proponents is the\nCouncil of Chief State School officers. Many (probably most) came from the\nteaching profession. Who know what it's like to be a teacher.\n\nThe author gives us some feel-good patronization about how teachers have it so\nhard and we have no right to impose standards upon them. But these standards\nexist because we can't fire bad teachers.\n\n~~~\nrmrfrmrf\nI don't think Core is garbage at all. I think there's a deeply ingrained\nculture of anti-intellectualism in US culture that needs to be nuked out of\nthe school system, and I honestly couldn't care less what the collateral\ndamage is.\n\n~~~\nsteveplace\nHere's the thing.\n\nYou like it when there's wide, sweeping cirriculum on the Federal level...\nwhen you agree with it.\n\nBut what happens if there's enough political pressure (it is a midterm\nelection cycle) to add ID into the cirriculum? Or maybe they look at feel-good\nmath that is just teaching to the test [1]?\n\nAnd that's the issue. Centralized power is great when you agree with it, but\nterrible in the wrong hands.\n\n[1] [http:\/\/www.momdot.com\/common-core-is-making-me-\nstupider\/](http:\/\/www.momdot.com\/common-core-is-making-me-stupider\/)\n\n~~~\nrmrfrmrf\nI agree with your point. I suppose I'm fortunate enough to also agree with the\ngoals of Common Core as they are today.\n\nOnto that article, however:\n\n1\\. I never use an academic degree as an indicator of intellectual capacity. I\nfind that some people are so objective-driven that they zoom right past the\npoint and straight to rageville when they don't understand something.\n\n2\\. A simple Google search on front-end estimation would have helped this mom\nrealize that the example given on the sheet is incorrect. I will concede that\nan effective teacher would have realized that the example given is incorrect\nand would have corrected it.\n\n(In front end estimation, you round the leftmost digit, so the example should\nactually be 400 + 300, not 300 + 200). IMHO 700 is actually a decent estimate\nfor 645, so I don't think there's a problem with the math itself. It's not\nreally feel-good math, but I think some people take for granted that\nestimation is not an innate ability.\n\nNow, it becomes another discussion altogether when the teacher is so horrible\nthat they refuse to accept that the example is wrong. But, I don't think I've\nseen evidence of that, so I won't accuse anyone of anything.\n\nEDIT: I just read some of the comments in that article, and it looks like some\ndistricts teach front-end estimation with truncation rather than rounding, in\nwhich case 300 + 200 = 500 would be correct.\n\nHere are a few more things to note: the parents here _assume_ that estimation\nand rounding are the same thing. That in itself isn't true.\n\nMore importantly, though, look at the _goal_ of the estimation -- to see if\nthe _actual_ answer, 645, is reasonable. That's _not_ the same thing as asking\nif 500 is a reasonable estimate of 645. I think the point of this exercise is\nfor kids to say \"ok, if I add these two numbers together, I _expect_ to get a\n3-digit number somewhere in the ballpark of 500.\" That is to say: if I add 354\nand 291, I shouldn't expect to get 20000 or 7 or 81 or 9750. It's just a\nsimple way of checking your work using a quick, easy method that you can do in\nyour head. Again, I find the value in this -- adding \"common sense\" to the\ncurriculum is definitely something I can get behind, but I understand that\nparents who aren't used to \"common sense on paper\" will struggle.\n\n------\nmildtrepidation\nI hate writing like this. Even if most people don't know the thing you're\nreferring to, basically telling the entire browsing population of the internet\n\"we're all stupid and here's why\" immediately leaves a bad taste, particularly\nfor people -- you know, like _teachers_ \\-- who _do_ know what teachers do, or\npeople who didn't make the assumption being assumed in the first place (which\nsays a lot more about the author than anything else).\n\nPedantic? Maybe. But to me this is a really childish way to make a point that\ncould be better stated in a way that doesn't instantly, baselessly denigrate\nthe reader, particularly when you're writing for a publication that banks on\nits credibility and reputation.\n\n------\npatmcc\nI have tons of respect and sympathy for teachers, but the argument I often\nhear for raising their pay (\"they work really hard, they're super important,\nit's a difficult job\") misses the central point.\n\nIt seems like we have enough teachers at the wages we currently pay. Teachers\nare willing to go into the profession despite the low wages, probably because\nthey want a satisfying job with good benefits. If we didn't have enough\nteachers...we'd have to raise wages. Supply and demand.\n\n~~~\nNursie\nAnd like many other situations which can be summed up as supply and demand, a\nrace to the bottom is an obvious outcome.\n\nMaybe we'd get better teachers if we paid more?\n\n~~~\npatmcc\nWe'd get better teachers if we paid more to good teachers. The problem is no\none can seem to agree on how to measure what makes a good teacher - one side\nis busy arguing seniority should be the primary measure, the other side argues\ntest scores, and neither one seems to want to spend any time or money figuring\nout an actually successful way to measure teacher skill.\n\n~~~\nmindslight\nYou could _ask the kids_. They certainly know which classes are engaging, and\nwhich are time-biding garbage. And ultimately, assuming a teacher isn't\nrunning a movie theatre, student interest _is_ the most important metric.\nYou'd of course have to keep the actual weighting process a bit fluid to avoid\nthe inmates gaining control of the asylum, but it should be quite\nstraightforward to pick out the extreme bad and extreme good teachers.\n\nIt would also be a good introduction to the rationale behind secret ballots,\nand when it is actually appropriate to lie.\n\n~~~\nameister14\nLook at ratemyprofessor and see how well an incredibly difficult professor\nthat is also engaging and interesting does; now imagine that in a situation\nwhere the people in his\/her class are forced to be there.\n\n~~~\nmindslight\nI took a quick look through that site, paging through my alma mater of a\ndecade ago. I do see pathologies in the ratings\/comments that remind me of\ncomplaints I would hear about professors from fellow students that were\nstressed, not getting the material, or used to a more structured environment.\nAnd if these ratings held weight with the university, I can definitely see\nprofessors dumbing down their lessons to avoid bad reviews. So I do see what\nyou're getting at with it going terribly wrong.\n\nStill, I think there's several key differences:\n\n1\\. Every school student would be rating their teachers, rather than just\nthose that loved a professor, had an axe to grind, or were encouraged to by an\nentertaining personality.\n\n2\\. The context would be \"closed\", with each teacher relative to their school,\nrather than open cross-institution competition with a front page of featured\n\"rockstar\" professors that make the rest seem inadequate.\n\n3\\. The high schools officially sanctioning ratings with real results would\ngive kids the feeling that they really do have a stake in the process, rather\nthan simply being its victims.\n\n4\\. High school is a more structured environment where the process details\nmatter a lot more. So a teacher eg giving out an incomplete homework problem\nis actually a valid indictment rather than the stressed out nitpicking of a\nculture shocked freshman.\n\n5\\. In college, there's a certain level of appreciation for the material that\neveryone should have but doesn't necessarily, causing them to get frustrated\nat a professor with a dry personality. Whereas with high school, the idea is\nthat everybody should be learning a cursory understanding of all subjects.\n\n6\\. In college, there's a huge variation in the level of courses. One specific\nprofessor I had for a seminar where it was basically his PhD research group\nand me, an undergrad who'd just started on a simultaneous master's. I learned\n_a lot_ in that class, and really appreciated him. I then ended up in a grad-\nlevel \"intro\" course with him (which I knew was an utter waste going in, but\nit was the only thing that fit my schedule). Most of the students were rote-\nmemorization paying-for-credential types, but his style certainly did them no\nfavors either, and I can definitely see my recollection echoed in a few of his\ncurrent reviews. I'd say that he's still a teaching asset, but not for intro\nlectures where most students aren't already committed to the subject.\n\nReally, there just needs to be _some_ extrinsic motivation\/reward for teachers\nthat are truly making a difference versus simply clock-punching, and that's\nnot more top-down testing edicts that further shackle them. And sure, the\nimmediate reaction shouldn't be to fire the lowest-reviewed, but neither\nshould we pretend that they deserve similar compensation to the exceptional\nones.\n\n------\ncarsongross\nYou think you know what field workers do. Right? Wrong.\n\nYou think you know what factory workers do. Right? Wrong.\n\nYou think you know what farmers do. Right? Wrong.\n\nYou think you know what oil rig operators do. Right? Wrong.\n\nYou think you know what coffee shop owners do. Right? Wrong.\n\nYou think you know what lawn care specialists do. Right? Wrong.\n\n~~~\nmandalar12\nI agree with your point: the title is sensationalist. The difference between\nteaching and owning a coffee shop (and the others examples) is that few people\nwill try to tell you how to handle your coffee shop while a lot think they\nknow better than you how their children should be taught.\n\n~~~\ncarsongross\nI've seen a close friend work 20 hours a day, barely make payroll, deal with\nemployee drug habits and try to minimize the legal damage a sociopathic\nemployee did.\n\nYou don't know what it's like owning a coffee shop.\n\n------\njerf\nIn other words, teachers are human and have real lives. This may be news to an\n18-year-old, but I'd really be surprised if it's really news to that many\npeople above 30. I may not be a teacher but I could fill a very stylistically-\nsimilar paragraph or two with the woes that have befallen me, too. Most people\ncan.\n\nThis strikes me as a variant on the _You don 't know what's like!_ meme... as\na rule of thumb, you should _never_ say that to anybody. You have no idea what\nthey've been through. Everyone you pass on the street has a story, and no\nmatter how bad you think yours is, you've got no guarantee that they don't\nhave one worse than you.\n\nWhat this essay describes is not specially \"teaching\", it's _life_.\n\n~~~\nSniperfish\nYou as an individual and your profession as a whole are different.\n\nThere is a very pertinent and legitimate point made in the article that\n-teaching- is not a respected industry.\n\nIt's not exactly a new comment!\n\n~~~\nhumanrebar\nCome to think of it, I don't think I hear teaching described as an industry\nvery often.\n\nWhat would be different if teaching were considered an industry? Would it be\nbetter?\n\n------\nVengefulCynic\nTeaching falls into the same category as stage magic, stand-up comedy and\nwriting - it looks easy and effortless when done by an expert because that's\npart of the expertise. Capturing attention, exciting young minds and engaging\nthem is something that, when done effectively, is transparent because that's\nhow it works best. The whole host of knock-on problems that are spawned by\nthis apparent ease are well-documented in TFA.\n\n------\nrjzzleep\ni see a lot of comments saying that we're watching from the sidelines\ncriticizing, and therefore have no clue what's going on.\n\nHow is that even remotely true? We are the victims of the system. We\nexperience firsthand what they do or believe they do.\n\nThis is like saying you think you know what the TSA is doing. Right? Wrong. Of\ncourse we do, we're the ones being screened.\n\nwhat we don't know is the logic and culture behind the decisions we see, but\nthat doesn't take any right away to criticize it.\n\nhaving been an overachiever in school, and early university, it's been a\nconstant struggle. \"oh but school is not actually made for people like you\"\nyou say. yeah, i know. how is that not a problem?\n\nedit: don't get me wrong, i've had a few really good teachers. but they've\nbeen rather few. and no, i'm not just counting the teachers i liked as good.\n\n~~~\nlewispollard\nDoes someone who's used a computer all their life know the ins and outs of\nbeing a programmer? Would you listen to their recommendations on how to\nimprove your code? The answer is likely yes, feedback from customers is\nimportant - but you're not gonna get any useful advice re: the architecture or\nthe design patterns used.\n\n------\ndanso\nAwhile ago, I had a teacher for a roommmate, and one who was young and very\npassionate, and I hope, good at it, because we were best friends and I'd hate\nto think I'd be a poor judge :). But I rarely heard her talk about the pure\njoy of teaching, at least compared to the difficulties of dealing with the\nmanagement (the principal) and other logistics issues...such as having to pay\nfor her own classroom supplies, including books that she wanted if they\nweren't on the state-wide curriculum, and pencil and paper for her poorer\nstudents.\n\nHer complaints about office politics were what really surprised me. Even\nthough I know every bureaucracy is universally crushing (well, maybe I grok\nbetter now after watching The Wire), it just seems that being a great,\npassionate teacher, supersedes any kind of office bullshit...such as the way\nprincipal communicates with you. But then again, if you can't get along with\nthe person who runs the place, and you're put in a shitty classroom and have\nto share a teacher's officespace with 3 other novices...how could that _not_\naffect your teaching performance and job satisfaction?\n\nOne memory I still have from high school was one afternoon when I had to stay\nafter school to give a presentation to the teachers on their regular Thursday-\nschool-wide meeting. The meeting was in the cafeteria...and you know how lunch\ntables reflect a sort of social-hierarchy among kids? It was no different for\nthe teachers...and even more surprising, the social lines seemed to fall along\nwith how I, as a student, expected them to (attractive young teachers sat with\nthe other young teachers; cool popular teachers could sit anywhere they want;\nthe weird chemistry teacher sat in the corner). I mean, it's one thing to have\nperceptions as a kid, but I _knew_ I was a petty kid...so it was a surprise to\nsee that things were not much different in the adult world.\n\n~~~\narbitrage\nGrok means to understand in fullness ... from the Heinlein novel, the\netymology of the word comes from to drink or to consume.\n\nYou cannot grok something just by watching it.\n\n~~~\ndanso\nYeah, but we're talking about _The Wire_ here :). But also I was an education\nreporter, worked as an aide, and have been part of other bureaucracies\nmyself...\n\n------\nnawitus\n>Most of all, we need to stop thinking that we know anything about teaching\nmerely by virtue of having once been students.\n\nI know something about teaching by reading peer-reviewed studies which give\nevidence for better teaching methods, but are almost never adopted because the\nteaching systems and\/or teachers are extremely conservative apparently all\naround the world.\n\nIn fact, I'd trust studies over teachers any day.\n\n------\nlarrik\nI feel like you could write this about basically any profession, besides the\nusual \"teachers are underpaid\" rant.\n\n------\nhumanrebar\n\n        > All of you former students: you did not design\n        > curricula, plan lessons, attend faculty meetings,\n        > assess papers, design rubrics, create exams, prepare \n        > report cards, and monitor attendance. You did\n        > not tutor students, review rough drafts, and create\n        > study questions. You did not assign homework. You\n        > did not write daily lesson objectives on the\n        > white board. You did not write poems of the week\n        > on the white board. You did not write homework on\n        > the white board. You did not learn to write\n        > legibly on the white board while simultaneously\n        > making sure that none of your students threw a\n        > chair out a window.\n    \n\nI'm not a teacher, so I could be wrong, but it seems to me that much of this\nlist falls into two categories:\n\n1\\. Routine things that could be orders of magnitude more efficient (or even\nfully automated) given enough resources. In most cases, the resources needed\nwould be fairly modest compared to the aggregate amount of effort teachers\neverywhere spend on them. Writing and grading elementary-level math tests, for\nexample, shouldn't take any time at all given the right software.\n\n2\\. Routine things that couldn't be automated well but could easily be done by\nsome sort of entry-level assistant. Babysitting and discipline tasks don't\nrequire college degrees.\n\nIt strikes me that the economics of education are structured in a way that\nthere is marginal impetus to improve efficiencies in the day-to-day work of\nteachers.\n\n~~~\nhackluck\nYou are not a teacher. And from your comments, you have not looked too much in\nthe research about how to teach students.\n\nYes, certain things COULD be automated... at considerable expense to student\nachievement. One big thing they have found - remove the personal feedback and\nconnection to students --> lose the motivation of students. If a teacher (the\nsame teacher) isn't interacting with a student consistently at nearly every\nstep of the learning process, the feedback doesn't stick and the student loses\nmotivation.\n\nIt would be interesting to looking to the basic research behind the feedback-\nachievement connection and stereotype threat to start.\n\nHope that helps you address some of the problems with the automate\/delegate\nsolutions so often thrown at teachers.\n\n~~~\nhumanrebar\n> Yes, certain things COULD be automated... at considerable expense to student\n> achievement.\n\nI seriously doubt that letting teachers automatically grade arithmetic tests\nwill hurt student achievement. The fact is that many teachers do that sort of\nthing at home in what should be considered overtime hours. I would like to\nhear how automatic grading causes student achievement to suffer.\n\nLikewise, I'm skeptical that it should be solely educators' responsibility to\nmake sure chairs are not being thrown out windows. Letting teachers focus on\neducating and not babysitting seems like a good thing.\n\n------\ncarlmcqueen\nI did two years of a special ed major in college before switching over to\ncomputer science and I can say that the ed program I was in covered in depth\nhow to teach and handle a class room, it focused on how to teach math to\npeople who don't understand any concepts, and the department had additional\noffered classes if you wanted to do teach for america or inner city schooling.\n\nSpeaking with friends who have become professors they are often jealous of\nthis because they were never given any kind of 'teaching' classes. Their under\ngrad wasn't in education and their teaching experience was trial by fire\nteaching assistant jobs of handling undergrad college courses.\n\nAll that said, I grow tired of the arguments and articles of 'don't speak\nunless you've walked a thousand miles' which I felt as I read this article.\nNot all knowledge and understanding must derive from doing something to have a\nvalid opinion. We need to treat teachers better and find better pay structures\nbut I've found no harsher critics of teachers and our schools than the\nteachers I went to college with as they filter into the systems and find tired\nand broken systems in which they get no voice until they have 'tenure'.\n\n~~~\nhackluck\n> All that said, I grow tired of the arguments and articles > of 'don't speak\n> unless you've walked a thousand miles' > which I felt as I read this\n> article. Not all knowledge and > understanding must derive from doing\n> something to have a > valid opinion. We need to treat teachers better and\n> find > better pay structures but I've found no harsher critics of > teachers\n> and our schools than the teachers I went to > college with as they filter\n> into the systems and find > tired and broken systems in which they get no\n> voice until > they have 'tenure'.\n\nI don't know that this article is so much about \"not speaking bad about\nteachers\", but about having compassion for teachers and talking about\neducation with a little more humility for the institution that helped produce\nyou. I would say this article is more of the \"teachers don't write articles\nabout how to __________ better, so don't let _______________ers tell teachers\nhow to teach better\" variety.\n\nAnd I totally agree that most young teachers are completely overwhelmed by the\nridiculous systems in which they are forced to teach. My only hope is that\nsome of these young, inspiring teachers remain in the profession long enough\nto change the broken system (which might take a LONG time!). The unions are\nbroken; for the most part, teachers are not.\n\n------\nhueving\nI'm not sure what the implication at the end is about public policy? Even if\nwe supposedly do not understand teaching, that does not mean we can't form\nopinions about the current system and develop policies for it. That's\nprecisely how politics work in every other field.\n\nHow many people who want to ban fracking actually understand fracking or\nprecisely what the real risks are? How many people want to ban nuclear energy\nand don't understand any of the actual risks of modern nuclear power plants?\n\nPolitics suck for anyone that isn't a politician. Each industry must learn how\nto deal with that aspect. Writing an appeal to emotion on the Washington Post\nis not going to sway anyone. It just resonates with people already on their\nside and sounds like whining to people that aren't.\n\n------\nnilkn\nSince the author says she started out making 5 times as much as a lawyer than\nas a teacher, I can only assume she landed one of the associate jobs at a\nmajor law firm straight out of law school making $160k+.\n\nShe makes it sound like anybody can hit up law school and come out making\nalmost $200k. The vast majority of law graduates do not land jobs like that.\nThe vast majority also have nearly crippling debt. The vast majority of the\nfirms paying $160k+ are also in hyper expensive metro areas, whereas teachers\ncan live comfortable lives in very rural towns (if they want to).\n\n~~~\nnumo16\nWhile what she is stating might not be the case for all law school grads, it\nisn't as far fetched to come out of school easily making 2-3 times what a\nstarting teacher is making, depepnding on the degree you choose. As a software\nengineer in michigan, you can come out of uni with a BS in computer science\nand easily find a job paying $55k+ and make 2-3 times as much as a starting\nteacher ($35k if you're lucky and find a good school that has funding) in the\nsame state after a year or two of experience.\n\n------\nfuse117\nThis story strikes home with me. Like the author, I too picked up an MAT,\ntaught for a couple years, and then left the field to pursue other\nopportunities. In the 3-4 years since I left, I have worked a lot less, made a\nlot more, and feel much more respected in what I do.\n\n------\nbiesnecker\n\"You think you know what teachers do. Right? Wrong.\"\n\nSo I'm wrong that I think that I know what teachers do?\n\nDo teachers teach you how to write intelligible headlines?\n\n------\nsmoyer\nMy wife teaches classes at a local high school as well as the university here\nshe's successful because she works hard at it, has a natural aptitude to teach\nand she cares about her subjects and shows it. I think I had 3-4 outstanding\nteachers during my 13 years in public school and they all had these same\ncharacteristics. I had plenty of bad teaches too.\n\n------\nPakG1\nMy cousin is a high school teacher and posted this article on Facebook with\nthe comment that it's like saying just because you had parents, you think you\nknow everything there is to know about parenting.\n\n------\nthe_watcher\nThis is just a painful argument to authority.\n\n------\ntokenadult\nEducation policy is the issue that drew me to participate on Hacker News,[1]\nso I'll jump in here too. I get the impression that mathattack, whose comments\nI enjoy reading, may have posted this article for disagreement. The Answer\nSheet blog from which this guest post comes is basically a propaganda organ,\nand some of the guest posts from the same blog that were submitted to Hacker\nNews in the past were exposed as hack jobs after discussion here.[2]\n\nThe obligatory disclosure here is to note that I am a classroom teacher by\noccupation. Over the years, I have been a teacher of Chinese to native\nspeakers of English, a teacher of English to native speakers of Chinese (and\nother languages), and most recently a teacher of advanced elementary\nmathematics (\"prealgebra\" mathematics for third-, fourth-, and fifth-graders)\nfor a nonprofit organization in my town. My HN user profile describes a bit\nmore of my background.\n\nYep, classroom teaching is hard, no doubt about it. It has emotional rewards\nthat some people value highly enough that it is a sought-after occupation, not\na labor-shortage occupation, and that has the most to do with teacher\ncompensation. Classroom teaching by teachers in private practice (like me) can\nalso be poorly compensated (relative to the difficulty of doing the job well)\nbecause most clients have already paid for \"free\" lessons at the local public\nschools through their taxes, and will only pay out of pocket for a private\nlesson if it is truly superior in some way. \"In modern times [as contrasted\nwith ancient times] the diligence of public teachers is more or less corrupted\nby the circumstances which render them more or less independent of their\nsuccess and reputation in their particular professions. Their salaries, too,\nput the private teacher, who would pretend to come into competition with them,\nin the same state with a merchant who attempts to trade without a bounty in\ncompetition with those who trade with a considerable one. . . . The privileges\nof graduation, besides, are in many countries . . . obtained only by attending\nthe lectures of the public teachers. . . . The endowment of schools and\ncolleges have, in this manner, not only corrupted the diligence of public\nteachers, but have rendered it almost impossible to have any good private\nones.\" \\-- Adam Smith, The Wealth of Nations, Book V, Part 3, Article II\n(1776)\n\nA couple of the comments posted here before I arrived in the thread mention\nthe particular skills that a teacher needs to have to teach a class\neffectively. There is much interesting research on this coming from the\ncharter school movement, with some of the best how-to research coming from the\nTeach Like a Champion[3] project. I love learning about new ways to be a more\neffective teacher. Besides actual teacher skills, another grave problem in\nUnited States school is extremely poor teaching materials[4] and I devote\nhundreds of hours to curriculum planning and seeking out the best available\ntextbooks[5] for the subjects I teach.\n\nA good teacher is worth a lot.[6] We would not go far wrong by saying that a\ngood teacher is literally worth his or her weight in gold. But the tricky\nissue in school administration is distinguishing effective from ineffective\nteachers. To ensure that school leaders have incentives to find and reward the\nbest teachers, we need to make sure that learners (or the adult guardians of\nminor learners) have the power to shop, the power to refuse the services of an\nineffective teacher and to seek out the services of an effective teacher.\nTeachers will gain both more pay and more respect if learners gain power to\nshop.\n\n[1]\n[http:\/\/news.ycombinator.com\/item?id=4728123](http:\/\/news.ycombinator.com\/item?id=4728123)\n\n[2]\n[https:\/\/news.ycombinator.com\/item?id=3327847](https:\/\/news.ycombinator.com\/item?id=3327847)\n\n[3] [http:\/\/teachlikeachampion.com\/](http:\/\/teachlikeachampion.com\/)\n\n[4]\n[http:\/\/open.salon.com\/blog\/annie_keeghan\/2012\/02\/17\/afraid_o...](http:\/\/open.salon.com\/blog\/annie_keeghan\/2012\/02\/17\/afraid_of_your_childs_math_textbook_you_should_be)\n\n[5]\n[http:\/\/www.artofproblemsolving.com\/Store\/viewitem.php?item=p...](http:\/\/www.artofproblemsolving.com\/Store\/viewitem.php?item=prealgebra)\n\n[6] [http:\/\/hanushek.stanford.edu\/publications\/valuing-\nteachers-h...](http:\/\/hanushek.stanford.edu\/publications\/valuing-teachers-how-\nmuch-good-teacher-worth)\n\n","meta":"{'id': '7318922'}"}
